---
type: IFailuresProcessor
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# IFailuresProcessor

`Autodesk.Revit.DB.IFailuresProcessor` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dismiss | — | `void Dismiss ( Document document )` |
| Method | ProcessFailures | — | `FailureProcessingResult ProcessFailures ( FailuresAccessor data )` |